<template>
<footer class="footer">
    <div class="container">
        <div class="footer__wrapper">
            <div class="footer-menu">
                <div class="footer-menu__column">
                    <div class="footer-menu__item">
                        <a class="footer-menu__label">
                            Обои
                        </a>
                        <div class="footer-menu__sublist">
                            <a href="" class="footer-menu__sublist-link">Цветы </a>
                            <a href="" class="footer-menu__sublist-link">Горы</a>
                            <a href="" class="footer-menu__sublist-link">Детские</a>
                            <a href="" class="footer-menu__sublist-link">Акварель</a>
                            <a href="" class="footer-menu__sublist-link">Геометрия</a>
                            <a href="" class="footer-menu__sublist-link">Градиенты</a>
                            <a href="" class="footer-menu__sublist-link">Модерн</a>
                            <a href="" class="footer-menu__sublist-link">Этника</a>
                            <a href="" class="footer-menu__sublist-link">Классика</a>
                            <a href="" class="footer-menu__sublist-link">Раскаски</a>
                            <a href="" class="footer-menu__sublist-link">Природа</a>
                        </div>

                    </div>
                </div>
                <div class="footer-menu__column">
                    <div class="footer-menu__item">
                        <a class="footer-menu__label">
                            Плитка
                        </a>
                        <div class="footer-menu__sublist">
                            <a href="" class="footer-menu__sublist-link">Красная </a>
                            <a href="" class="footer-menu__sublist-link">Не очень красная</a>
                            <a href="" class="footer-menu__sublist-link">Почти не красная</a>
                            <a href="" class="footer-menu__sublist-link">Возможно красная</a>

                        </div>
                    </div>
                    <div class="footer-menu__item">
                        <a class="footer-menu__label">
                            Картины
                        </a>
                        <div class="footer-menu__sublist">
                            <a href="" class="footer-menu__sublist-link">Квадратные картины </a>
                            <a href="" class="footer-menu__sublist-link">Не Квадратные картины</a>

                        </div>
                    </div>
                </div>
                <div class="footer-menu__column">
                    <div class="footer-menu__item">
                        <a class="footer-menu__label">
                            Краска
                        </a>
                        <div class="footer-menu__sublist">
                            <a href="" class="footer-menu__sublist-link">Для стен </a>
                            <a href="" class="footer-menu__sublist-link">Не для стен</a>
                            <a href="" class="footer-menu__sublist-link">Для потолка</a>
                            <a href="" class="footer-menu__sublist-link">Для пола</a>

                        </div>
                    </div>
                </div>
                <div class="footer-menu__column">
                    <div class="footer-menu__item">
                        <a class="footer-menu__label">
                            Телепорт в нарнию
                        </a>
                        <div class="footer-menu__sublist">
                            <a href="" class="footer-menu__sublist-link">Ну поехали</a>

                        </div>
                    </div>
                </div>
            </div>
            <div class="footer-info">
                <div class="footer-info__item">
                    <a class="footer-info__label">
                        Компаниям
                    </a>
                    <div class="footer-info__sublist">
                        <a href="" class="footer-info__sublist-link">О нас</a>
                        <a href="" class="footer-info__sublist-link">Оплата и доставка</a>
                        <a href="" class="footer-info__sublist-link"> Наш шоурум</a>
                        <a href="" class="footer-info__sublist-link"> Где купить</a>
                        <a href="" class="footer-info__sublist-link"> Контакты</a>
                        <a href="" class="footer-info__sublist-link"> Портфолио</a>

                    </div>
                </div>
            </div>
            <div class="footer-contacts">
                <a class="footer-contacts__label">Контакты</a>
                <div class="footer-contacts__main">
                    <div class="footer-contacts__item">
                        <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_1_318)">
                                <path d="M11.8547 9.29201C11.5476 8.97226 11.1772 8.8013 10.7846 8.8013C10.3952 8.8013 10.0217 8.96909 9.7019 9.28884L8.70149 10.2861C8.61918 10.2418 8.53687 10.2006 8.45772 10.1595C8.34375 10.1025 8.23611 10.0486 8.1443 9.99166C7.20721 9.39648 6.3556 8.62085 5.53881 7.61727C5.14308 7.11707 4.87714 6.69601 4.68403 6.26862C4.94363 6.03118 5.18423 5.78424 5.41851 5.54681C5.50715 5.45816 5.59579 5.36635 5.68444 5.27771C6.34927 4.61288 6.34927 3.75177 5.68444 3.08694L4.82016 2.22266C4.72202 2.12452 4.62071 2.02321 4.52573 1.9219C4.33578 1.72562 4.13633 1.52301 3.93055 1.33306C3.62347 1.02913 3.25623 0.867676 2.86999 0.867676C2.48376 0.867676 2.11019 1.02913 1.7936 1.33306C1.79044 1.33622 1.79044 1.33622 1.78727 1.33939L0.710881 2.42528C0.305652 2.8305 0.0745449 3.32438 0.0238913 3.8974C-0.0520892 4.82183 0.220174 5.68294 0.42912 6.24646C0.941989 7.62994 1.70813 8.91211 2.851 10.2861C4.23764 11.9418 5.90605 13.2493 7.81189 14.1706C8.54004 14.5157 9.51195 14.9241 10.5978 14.9937C10.6643 14.9969 10.734 15 10.7973 15C11.5286 15 12.1428 14.7373 12.624 14.2149C12.6272 14.2086 12.6335 14.2054 12.6367 14.1991C12.8013 13.9996 12.9912 13.8192 13.1907 13.6261C13.3268 13.4963 13.4661 13.3601 13.6022 13.2177C13.9157 12.8916 14.0803 12.5117 14.0803 12.1223C14.0803 11.7297 13.9125 11.353 13.5927 11.0364L11.8547 9.29201ZM12.9881 12.6257C12.9849 12.6257 12.9849 12.6288 12.9881 12.6257C12.8646 12.7586 12.738 12.8789 12.6018 13.0119C12.396 13.2082 12.1871 13.4139 11.9908 13.6451C11.6711 13.987 11.2943 14.1484 10.8005 14.1484C10.753 14.1484 10.7023 14.1484 10.6548 14.1453C9.71457 14.0851 8.84079 13.7179 8.18546 13.4045C6.39359 12.537 4.82016 11.3055 3.51266 9.74473C2.43311 8.44356 1.71129 7.24054 1.23325 5.94887C0.938823 5.16057 0.831184 4.5464 0.878672 3.96705C0.91033 3.59664 1.05279 3.28955 1.31556 3.02679L2.39512 1.94723C2.55024 1.8016 2.71487 1.72246 2.87632 1.72246C3.07577 1.72246 3.23723 1.84276 3.33854 1.94407C3.34171 1.94723 3.34487 1.9504 3.34804 1.95356C3.54115 2.13402 3.72477 2.3208 3.91789 2.52025C4.01603 2.62156 4.11734 2.72287 4.21865 2.82734L5.08292 3.69162C5.4185 4.0272 5.4185 4.33745 5.08292 4.67303C4.99111 4.76484 4.90247 4.85665 4.81066 4.94529C4.54473 5.21756 4.29146 5.47083 4.01603 5.71776C4.0097 5.72409 4.00337 5.72726 4.0002 5.73359C3.72794 6.00585 3.77859 6.27179 3.83558 6.45224C3.83874 6.46174 3.84191 6.47123 3.84508 6.48073C4.06985 7.02526 4.38644 7.53813 4.86765 8.14914L4.87081 8.1523C5.74459 9.22869 6.66585 10.0676 7.68209 10.7103C7.81189 10.7926 7.94486 10.8591 8.07149 10.9224C8.18546 10.9794 8.2931 11.0332 8.38491 11.0902C8.39757 11.0965 8.41024 11.106 8.4229 11.1124C8.53054 11.1662 8.63185 11.1915 8.73632 11.1915C8.99908 11.1915 9.16371 11.0269 9.21753 10.9731L10.3003 9.89036C10.4079 9.78272 10.5788 9.65292 10.7783 9.65292C10.9746 9.65292 11.136 9.77638 11.2342 9.88402C11.2373 9.88719 11.2373 9.88719 11.2405 9.89036L12.9849 11.6347C13.311 11.9577 13.311 12.2901 12.9881 12.6257Z"
                                      fill="#CA3192"/>
                                <path d="M8.10631 3.56805C8.93577 3.70735 9.68925 4.09992 10.2908 4.70143C10.8923 5.30294 11.2817 6.05641 11.4241 6.88587C11.459 7.09481 11.6394 7.24044 11.8452 7.24044C11.8705 7.24044 11.8927 7.23728 11.918 7.23411C12.1523 7.19612 12.3074 6.97451 12.2694 6.74024C12.0985 5.73666 11.6236 4.82173 10.8986 4.09675C10.1736 3.37177 9.25869 2.89689 8.25511 2.72594C8.02084 2.68795 7.80239 2.84307 7.76124 3.07418C7.72008 3.30529 7.87204 3.53006 8.10631 3.56805Z"
                                      fill="#CA3192"/>
                                <path d="M14.9826 6.61682C14.7008 4.96424 13.922 3.46046 12.7253 2.26377C11.5286 1.06708 10.0248 0.288277 8.37225 0.00651579C8.14114 -0.0346403 7.9227 0.123652 7.88154 0.35476C7.84355 0.589033 7.99868 0.807477 8.23295 0.848633C9.70824 1.09873 11.0537 1.79839 12.1238 2.86528C13.1938 3.93534 13.8903 5.28083 14.1404 6.75611C14.1753 6.96506 14.3557 7.11069 14.5615 7.11069C14.5868 7.11069 14.609 7.10752 14.6343 7.10436C14.8654 7.06953 15.0237 6.84792 14.9826 6.61682Z"
                                      fill="#CA3192"/>
                            </g>
                            <defs>
                                <clipPath id="clip0_1_318">
                                    <rect width="15" height="15" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>

                        <a href="mailto:welcome@re-space.ru">welcome@re-space.ru</a>
                    </div>
                    <div class="footer-contacts__item">
                        <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M14.4803 2.56234C14.3011 2.38313 14.086 2.25768 13.853 2.16807C13.853 2.16807 13.853 2.16807 13.8351 2.16807C13.7814 2.15015 13.7276 2.13223 13.6738 2.11431C13.6559 2.11431 13.6559 2.11431 13.638 2.11431C13.5842 2.09639 13.5305 2.09639 13.4767 2.07847C13.4588 2.07847 13.4409 2.07847 13.4409 2.07847C13.3692 2.07847 13.3154 2.06055 13.2437 2.06055H1.77419C1.70251 2.06055 1.64875 2.06055 1.57706 2.07847C1.55914 2.07847 1.54122 2.07847 1.54122 2.07847C1.48746 2.07847 1.43369 2.09639 1.37993 2.11431C1.36201 2.11431 1.36201 2.11431 1.34409 2.11431C1.29032 2.13223 1.23656 2.15015 1.1828 2.16807C1.1828 2.16807 1.1828 2.16807 1.16487 2.16807C0.9319 2.25768 0.716846 2.40105 0.537634 2.56234C0.519713 2.56234 0.519713 2.58026 0.501792 2.59818C0.483871 2.6161 0.46595 2.63402 0.448029 2.65194C0.430108 2.68779 0.394265 2.70571 0.376344 2.74155C0.358423 2.75947 0.358423 2.75947 0.340502 2.77739C0.340502 2.77739 0.340502 2.79531 0.322581 2.79531C0.125448 3.08205 0 3.42255 0 3.7989V11.1824C0 11.6484 0.179211 12.0785 0.483871 12.3831C0.483871 12.4011 0.501792 12.4011 0.501792 12.419C0.824373 12.7416 1.25448 12.9387 1.73835 12.9387H13.2437C13.7276 12.9387 14.1577 12.7416 14.4803 12.419C14.8029 12.0964 15 11.6663 15 11.1824V3.7989C15 3.31503 14.8029 2.88492 14.4803 2.56234ZM1.59498 2.97453C1.64875 2.9566 1.70251 2.9566 1.75627 2.9566H13.2437C13.2975 2.9566 13.3513 2.9566 13.405 2.97453C13.4588 2.99245 13.5125 3.01037 13.5663 3.02829L10.8602 5.25051L7.83154 7.70571L7.81362 7.72363C7.72401 7.79532 7.61649 7.83116 7.50896 7.83116C7.40143 7.83116 7.29391 7.79532 7.2043 7.72363L4.15771 5.25051L1.43369 3.02829C1.48746 3.01037 1.54122 2.99245 1.59498 2.97453ZM14.086 11.1824C14.086 11.4154 13.9964 11.6125 13.8351 11.7738C13.6918 11.9172 13.4767 12.0247 13.2437 12.0247H1.77419C1.54122 12.0247 1.34409 11.9351 1.1828 11.7738L1.16487 11.7559C1.02151 11.6125 0.9319 11.4154 0.9319 11.1824V3.81682L3.58423 5.96736L5.2509 7.32937L2.63441 9.82041C2.4552 9.99962 2.43728 10.2864 2.61649 10.4656C2.7957 10.6448 3.08244 10.6627 3.26165 10.4835L5.96774 7.90284L6.63083 8.44048C6.89964 8.65553 7.2043 8.76306 7.50896 8.74514C7.83154 8.74514 8.1362 8.63761 8.3871 8.42256L8.40502 8.40464L9.05018 7.88492L11.7742 10.4835C11.9534 10.6627 12.2401 10.6448 12.4194 10.4656C12.5986 10.2864 12.5806 9.99962 12.4014 9.82041L9.76703 7.31144L11.4337 5.96736L14.086 3.81682V11.1824Z"
                                  fill="#CA3192"/>
                        </svg>
                        <a href="tel:+78003508415">8 800 350 84 15</a>
                    </div>
                </div>
                <div class="menu-social menu-social_footer">
                    <a href="" class="menu-social__item">
                        <img src="/icon/social/instagram.svg" alt="" class="menu-social__image">
                    </a>
                    <a href="" class="menu-social__item">
                        <img src="/icon/social/facebook.svg" alt="" class="menu-social__image">
                    </a>
                    <a href="" class="menu-social__item">
                        <img src="/icon/social/twitter.svg" alt="" class="menu-social__image">
                    </a>
                    <a href="" class="menu-social__item">
                        <img src="/icon/social/pinterest.svg" alt="" class="menu-social__image">
                    </a>
                    <a href="" class="menu-social__item">
                        <img src="/icon/social/youtube.svg" alt="" class="menu-social__image">
                    </a>
                </div>
            </div>
        </div>
    </div>

    <button class="button-up">
        <svg width="30" height="17" viewBox="0 0 30 17" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M14.1769 0.337994L0.32404 14.1908C-0.118872 14.6494 -0.106155 15.3802 0.352449 15.8231C0.799824 16.2552
            1.50904 16.2552 1.95634 15.8231L14.993 2.78645L28.0297 15.8231C28.4804 16.2738 29.2112 16.2738 29.662 15.8231C30.1127
            15.3723 30.1127 14.6416 29.662 14.1908L15.8092 0.337994C15.3583 -0.112696 14.6276 -0.112696 14.1769 0.337994Z"
                  fill="white"/>
        </svg>
    </button>
</footer>
</template>

<script>
export default {
    name: "Footer"
}
</script>

<style scoped>

</style>